app/controllers/enemies_controller.rb

SELECT "enemies".* FROM "enemies"
---
  def index
    @enemies = Enemy.all

INSERT INTO "enemies" ("name", "power_base", "power_step", "level", "kind", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["name", "quae"], ["power_base", 1991], ["power_step", 8957], ["level", 50], ["kind", 0], ["created_at", "2020-01-05 20:23:45.759476"], ["updated_at", "2020-01-05 20:23:45.759476"]]
---
  def create
    if Enemy.create(enemy_params)

UPDATE "enemies" SET "name" = ?, "power_base" = ?, "power_step" = ?, "level" = ?, "kind" = ?, "updated_at" = ? WHERE "enemies"."id" = ?  [["name", "ullam"], ["power_base", 3817], ["power_step", 8140], ["level", 47], ["kind", 2], ["updated_at", "2020-01-05 13:32:57.083392"], ["id", 1]]
---
  def update
    if @enemy.update(enemy_params)

DELETE FROM "enemies" WHERE "enemies"."id" = ?  [["id", 1]]
---
  def destroy
    @enemy.destroy

SELECT "enemies".* FROM "enemies" WHERE "enemies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_enemy
    begin
      @enemy = Enemy.find(params[:id])