app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("created_at", "updated_at", "nickname", "kind", "level") VALUES (?, ?, ?, ?, ?)  [["created_at", "2019-12-30 17:13:09.224358"], ["updated_at", "2019-12-30 17:13:09.224358"], ["nickname", "repudiandae"], ["kind", 1], ["level", 37]]