app/controllers/weapons_controller.rb

  def index
    @weapons = Weapon.all
---
SELECT "weapons".* FROM "weapons"

  def create
    weapon = Weapon.create(weapon_params)
---
INSERT INTO "weapons" ("name", "power_base", "power_step", "level", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Janita Sauer"], ["power_base", 6], ["power_step", 60], ["level", 25], ["created_at", "2020-01-01 20:40:47.209873"], ["updated_at", "2020-01-01 20:40:47.209873"]]

  def show
    @weapon = Weapon.find(params[:id])
---
SELECT "weapons".* FROM "weapons" WHERE "weapons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    id     = params[:id]
    weapon = Weapon.find(id)
    weapon.destroy
---
SELECT "weapons".* FROM "weapons" WHERE "weapons"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "weapons" WHERE "weapons"."id" = ?  [["id", 1]]